export const TermOfUse = () => {
  return (
    <div className='flex w-full flex-col items-center justify-center'>
      <br />
      <div className='w-[140px] border-b border-gray-500 text-xl'>서비스 이용 약관</div>
      <br />
      <p className='w-[800px] text-xs'>
        본 약관은 누떡(NUDDUCK)(이하 "회사"라 함)이 제공하는 서비스의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다. 서비스를 이용하시기 전, 본
        약관을 주의 깊게 읽어주시기 바랍니다.
        <br />
        <br />
        <span className='font-bold'>제 1 조 (목적)</span>
        <br />
        이 약관은 회사가 제공하는 모든 서비스의 이용 조건 및 절차, 회원과 회사의 권리, 의무 및 책임사항을 규정하는 것을 목적으로 합니다.
        <br />
        <br />
        <span className='font-bold'>제 2 조 (정의)</span>
        <br />
        본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
        <br />
        1. 서비스: 회사가 제공하는 모든 온라인 및 모바일 서비스
        <br />
        2. 회원: 회사의 서비스에 접속하여 본 약관에 따라 이용 계약을 체결하고, 회사가 제공하는 서비스를 이용하는 자
        <br />
        3. 소셜로그인이라 함은 회원의 식별과 서비스 이용을 위하여 회원이 가입 시 구글, 카카오 등과 연동을 하는 방식으로, 연동 업체로부터 획득한 ID 또는 이메일주소 와 인증키를 통하여 회원 가입하는
        방식을 말하며, 소셜로그인을 이용하는 회원의 경우에 계정이란 소셜로그인시 사용되는 ID 또는 이메일주소와 인증키를 합한 것을 의미합니다.
        <br />
        <br />
        <span className='font-bold'>제 3 조 (약관의 효력 및 변경)</span>
        <br />
        1. 본 약관은 서비스를 이용하고자 하는 모든 회원에게 그 효력이 발생합니다.
        <br />
        2. 회사는 필요에 따라 관련 법령을 위배하지 않는 범위에서 본 약관을 변경할 수 있으며, 변경된 약관은 서비스 내에 공지함으로써 효력이 발생합니다. 변경된 약관에 대한 동의는 회원이 변경된 약관에
        대한 공지 후에도 서비스를 계속 이용할 경우 해당 약관에 동의한 것으로 간주합니다.
        <br />
        <br />
        <span className='font-bold'>제 4 조 (회원 가입 및 계약의 성립)</span>
        <br />
        1. 회원 가입은 서비스를 이용하고자 하는 자가 본 약관에 동의하고, 회사가 정한 절차에 따라 회원 가입 신청을 하며, 회사가 이를 승낙함으로써 성립됩니다.
        <br />
        2. 회사는 다음과 같은 경우에 회원 가입 신청을 거부하거나 승낙을 취소할 수 있습니다:
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 가입 신청자가 본 약관에 위반된 행위를 한 경우
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 다른 사람의 명의를 사용하거나 허위 정보를 제공한 경우
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 기타 회사가 합리적인 판단에 따라 필요하다고 인정하는 경우
        <br />
        <br />
        <span className='font-bold'>제 5 조 (회원의 의무)</span>
        <br />
        1. 회원은 본 약관, 회사의 공지사항 및 관련 법령을 준수해야 하며, 회사의 업무에 방해되는 행위를 해서는 안 됩니다.
        <br />
        2. 회원은 서비스 이용 시 다음과 같은 행위를 해서는 안 됩니다:
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 타인의 정보 도용
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 불법적인 콘텐츠의 게시
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 서비스의 정상적인 운영을 방해하는 행위
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 기타 법령을 위반하는 행위
        <br />
        <br />
        <span className='font-bold'>제 6 조 (서비스의 제공 및 중단)</span>
        <br />
        1. 회사는 회원에게 다음과 같은 서비스를 제공합니다:
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 인공지능 면접 코칭 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 전문가 상담 연결 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 커뮤니티 게시글과 댓글 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 인생 그래프 제작 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 사용자 프로필 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 1:1 채팅 서비스
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 기타 회사의 부가적인 서비스
        <br />
        2. 회사는 필요한 경우 서비스의 전부 또는 일부를 사전 공지 후 중단할 수 있으며, 서비스 중단에 대한 책임은 회사에 없습니다.
        <br />
        <br />
        <span className='font-bold'>제 7 조 (개인정보의 보호)</span>
        <br />
        회사는 회원의 개인정보를 보호하기 위해 관련 법령에 따라 개인정보 처리방침을 제정하고, 회원의 개인정보를 적절히 보호합니다. 개인정보 보호에 관한 사항은 회사의 개인정보 처리방침을 따릅니다.
        <br />
        <br />
        <span className='font-bold'>제 8 조 (계약 해지 및 이용 제한)</span>
        <br />
        1. 회원은 언제든지 서비스 내의 회원 탈퇴 기능을 통해 이용 계약을 해지할 수 있습니다.
        <br />
        2. 회사는 다음과 같은 경우에 사전 통지 없이 이용 계약을 해지하거나 서비스 이용을 제한할 수 있습니다:
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 회원이 본 약관을 위반한 경우
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 회원이 불법적인 행위를 한 경우
        <br />
        &nbsp;&nbsp;&nbsp;&nbsp;▪︎ 기타 회사가 합리적인 판단에 따라 서비스 제공을 중단할 필요가 있다고 인정하는 경우
        <br />
        <br />
        <span className='font-bold'>제 9 조 (면책 조항)</span>
        <br />
        1. 회사는 천재지변, 전쟁, 기간통신사업자의 중대한 장애 등 불가항력적인 사유로 인해 서비스를 제공할 수 없는 경우에 책임을 지지 않습니다.
        <br />
        2. 회사는 회원의 귀책 사유로 인해 발생한 서비스 이용의 장애에 대해 책임을 지지 않습니다.
        <br />
        <br />
        <span className='font-bold'>제 10 조 (준거법 및 관할법원)</span>
        <br />
        본 약관에 관하여 발생한 분쟁에 대해서는 대한민국 법을 준거법으로 하며, 관할법원은 회사의 본사 소재지 관할 법원으로 합니다.
        <br />
        <br />
        <span className='font-bold'>부칙</span>
        <br />
        1. 본 약관은 2024년 10월 04일부터 적용됩니다.
      </p>
    </div>
  );
};

export default TermOfUse;
